Lab_original/Lab04-heatTransfer/Lab04-heatTransfer/combustor2D_highT_lowRe/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0 10 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    splitter
    {
        type            noSlip;
    }
    fuel_inlet
    {
        type            fixedValue;
        value           uniform (0 15 0);
    }
    back
    {
        type            noSlip;
    }
    sides
    {
        type            noSlip;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
