Lab_original/Lab04-heatTransfer/Lab04-heatTransfer/combustor2D_highT_lowRe/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "rho.*"
    {
        solver          diagonal;
        tolerance       1e-09;
        relTol          0;
    }
    
    p
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0.1;
        smoother        GaussSeidel;
    }

    pFinal
    {
        $p;
        relTol 0;
    }    

    "(U|k|epsilon|h)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0.1;
    }
    "(U|k|epsilon|h)Final"
    {
        $U;
        relTol          0;
    }

}

PIMPLE
{
    nCorrectors 1;
    nOuterCorrectors 20;
    nNonOrthogonalCorrectors 0;
    consistent no;
    outerCorrectorResidualControl
    {
        p 
        {
            tolerance 1e-4;
            relTol 0;
        }

        U 
        {
            tolerance 1e-5;
            relTol 0;
        }

    }
}


relaxationFactors
{
    fields
    {
        "p.*" 0.3;
    }
    equations
    {
        "U.*"  0.7;
        "(k|epsilon)" 0.5;
        "(h|e)"       0.5;
    }
}


// ************************************************************************* //
